In [1]:
import pandas as pd
import numpy as np

# Missing Values

In [7]:
data = np.array([[1,2,np.nan], [2,np.nan,4], [3,4,5]])
df = pd.DataFrame(data)
df

     0    1    2
0  1.0  2.0  NaN
1  2.0  NaN  4.0
2  3.0  4.0  5.0

In [8]:
df.isna()

       0      1      2
0  False  False   True
1  False   True  False
2  False  False  False

In [9]:
df.isna().sum()

0    0
1    1
2    1
dtype: int64

In [12]:
df.isna().any()

0    False
1     True
2     True
dtype: bool

In [14]:
df.isna().any().any()

True

In [15]:
customers = pd.read_csv("Mall_Customers_missing.csv");
customers

     CustomerID  Gender   Age  Annual Income (k$)  Spending Score (1-100)
0             1    Male  19.0                15.0                    39.0
1             2    Male  21.0                15.0                    81.0
2             3  Female  20.0                16.0                     6.0
3             4  Female  23.0                16.0                    77.0
4             5  Female  31.0                17.0                    40.0
..          ...     ...   ...                 ...                     ...
195         196  Female  35.0               120.0                    79.0
196         197  Female  45.0               126.0                    28.0
197         198    Male  32.0               126.0                    74.0
198         199    Male  32.0               137.0                    18.0
199         200    Male  30.0               137.0                     NaN

[200 rows x 5 columns]

In [16]:
customers.describe

<bound method NDFrame.describe of      CustomerID  Gender   Age  Annual Income (k$)  Spending Score (1-100)
0             1    Male  19.0                15.0                    39.0
1             2    Male  21.0                15.0                    81.0
2             3  Female  20.0                16.0                     6.0
3             4  Female  23.0                16.0                    77.0
4             5  Female  31.0                17.0                    40.0
..          ...     ...   ...                 ...                     ...
195         196  Female  35.0               120.0                    79.0
196         197  Female  45.0               126.0                    28.0
197         198    Male  32.0               126.0                    74.0
198         199    Male  32.0               137.0                    18.0
199         200    Male  30.0               137.0                     NaN

[200 rows x 5 columns]>

In [22]:
customers.isna().mean()

CustomerID                0.00
Gender                    0.00
Age                       0.02
Annual Income (k$)        0.02
Spending Score (1-100)    0.04
dtype: float64

In [52]:
#total amount of missing values
customers.isna().sum().sum()

12

In [39]:
#how many rows have null values
customers.isna().any(axis=1).sum()

14

In [43]:
#show the rows that have null values
customers[customers.isna().any(axis=1)]

     CustomerID  Gender   Age  Annual Income (k$)  Spending Score (1-100)
8             9    Male  64.0                19.0                     NaN
13           14  Female  24.0                20.0                     NaN
17           18    Male   NaN                21.0                    66.0
25           26    Male   NaN                28.0                    82.0
42           43    Male   NaN                 NaN                     NaN
45           46  Female   NaN                39.0                    65.0
67           68  Female  68.0                48.0                     NaN
70           71    Male  70.0                49.0                     NaN
107         108    Male  54.0                63.0                     NaN
121         122  Female  38.0                 NaN                    40.0
122         123  Female  40.0                 NaN                    58.0
123         124    Male  39.0                 NaN                    91.0
193         194  Female  38.0               113.0                     NaN
199         200    Male  30.0               137.0                     NaN

In [48]:
customers.dropna()

     CustomerID  Gender   Age  Annual Income (k$)  Spending Score (1-100)
0             1    Male  19.0                15.0                    39.0
1             2    Male  21.0                15.0                    81.0
2             3  Female  20.0                16.0                     6.0
3             4  Female  23.0                16.0                    77.0
4             5  Female  31.0                17.0                    40.0
..          ...     ...   ...                 ...                     ...
194         195  Female  47.0               120.0                    16.0
195         196  Female  35.0               120.0                    79.0
196         197  Female  45.0               126.0                    28.0
197         198    Male  32.0               126.0                    74.0
198         199    Male  32.0               137.0                    18.0

[186 rows x 5 columns]

In [53]:
customers['Age'].fillna(customers['Age'].mean(), inplace = True)

In [55]:
customers.fillna(0)

     CustomerID  Gender   Age  Annual Income (k$)  Spending Score (1-100)
0             1    Male  19.0                15.0                    39.0
1             2    Male  21.0                15.0                    81.0
2             3  Female  20.0                16.0                     6.0
3             4  Female  23.0                16.0                    77.0
4             5  Female  31.0                17.0                    40.0
..          ...     ...   ...                 ...                     ...
195         196  Female  35.0               120.0                    79.0
196         197  Female  45.0               126.0                    28.0
197         198    Male  32.0               126.0                    74.0
198         199    Male  32.0               137.0                    18.0
199         200    Male  30.0               137.0                     0.0

[200 rows x 5 columns]

In [63]:
customers.iloc[119:125]

     CustomerID  Gender   Age  Annual Income (k$)  Spending Score (1-100)
119         120  Female  50.0                67.0                    57.0
120         121    Male  27.0                67.0                    56.0
121         122  Female  38.0                 NaN                    40.0
122         123  Female  40.0                 NaN                    58.0
123         124    Male  39.0                 NaN                    91.0
124         125  Female  23.0                70.0                    29.0

In [64]:
#Fills the NaN value with the previous value
customers['Annual Income (k$)'].fillna(method='ffill', inplace=True)

In [65]:
customers.iloc[119:125]

     CustomerID  Gender   Age  Annual Income (k$)  Spending Score (1-100)
119         120  Female  50.0                67.0                    57.0
120         121    Male  27.0                67.0                    56.0
121         122  Female  38.0                67.0                    40.0
122         123  Female  40.0                67.0                    58.0
123         124    Male  39.0                67.0                    91.0
124         125  Female  23.0                70.0                    29.0

In [67]:
customers.dropna(inplace = True)

In [71]:
#length of rows after filtering
len(customers)

192

In [72]:
potholes = pd.read_csv("Street_Pothole_Work_Orders_-_Closed__Dataset_.csv")

In [74]:
len(potholes)

323871

In [92]:
potholes[potholes['HouseNum'].isna()]

0         NaN
1         NaN
5         NaN
8         NaN
10        NaN
         ...
323815    NaN
323817    NaN
323823    NaN
323825    NaN
323839    NaN
Name: HouseNum, Length: 104258, dtype: object